Revit 2024 API
BuiltInFailures.RoomFailures.RoomTagNotInRoomToArea Property
 [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomTagNotInRoomToArea { get; }
Visual Basic
Public Shared ReadOnly Property RoomTagNotInRoomToArea As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomTagNotInRoomToArea {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace